Testsuite/TESTSUIT/preCICE/PerpendicularFlapFoam/fluid-openfoam/system/blockMeshDict
/* generated by make_meshes.py - edit the block spec there, not here */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-1.5 0 0)
    (-0.05 0 0)
    (0.05 0 0)
    (1.5 0 0)
    (-1.5 1 0)
    (-0.05 1 0)
    (0.05 1 0)
    (1.5 1 0)
    (-1.5 2 0)
    (-0.05 2 0)
    (0.05 2 0)
    (1.5 2 0)
    (-1.5 0 0.1)
    (-0.05 0 0.1)
    (0.05 0 0.1)
    (1.5 0 0.1)
    (-1.5 1 0.1)
    (-0.05 1 0.1)
    (0.05 1 0.1)
    (1.5 1 0.1)
    (-1.5 2 0.1)
    (-0.05 2 0.1)
    (0.05 2 0.1)
    (1.5 2 0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (7 8 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (7 8 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (7 4 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (2 4 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (7 4 1) simpleGrading (1 1 1)
);

boundary
(
    s_inlet
    {
        type patch;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }
    s_outlet
    {
        type patch;
        faces
        (
            (3 7 19 15)
            (7 11 23 19)
        );
    }
    s_walls
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
    s_FluidSide_Interface1
    {
        type wall;
        faces
        (
            (1 5 17 13)
        );
    }
    s_FluidSide_Interface2
    {
        type wall;
        faces
        (
            (2 14 18 6)
        );
    }
    s_FluidSide_Interface3
    {
        type wall;
        faces
        (
            (5 17 18 6)
        );
    }
    s_frontAndBack_fluid
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (12 13 17 16)
            (14 15 19 18)
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
        );
    }
);
