Testsuite/TESTSUIT/preCICE/PerpendicularFlapFoam/fluid-openfoam/0/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    s_inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    s_outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    s_walls
    {
        type            slip;
    }
    
    s_FluidSide_Interface1
    {
        type            fixedValue;
        value           $internalField;
    }
    
    s_FluidSide_Interface2
    {
        type            fixedValue;
        value           $internalField;
    }
    
    s_FluidSide_Interface3
    {
        type            fixedValue;
        value           $internalField;
    }

    s_frontAndBack_fluid
    {
        type            empty;
    }
}
