Testsuite/TESTSUIT/preCICE/PerpendicularFlapFoam/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

// the solver runs with `-case fluid-openfoam` FROM THE TEST DIRECTORY (same
// working directory as cfs, so the relative preCICE exchange directory matches);
// the config path is resolved relative to that working directory
preciceConfig   "precice-config.xml";
participant     Fluid;

modules ( FSI );

interfaces
{
    Interface1
    {
        mesh        Fluid-Faces1;
        patches     ( s_FluidSide_Interface1 );
        locations   faceCenters;

        writeData ( Stress );
    }
    Interface2
    {
        mesh        Fluid-Nodes1;
        patches     ( s_FluidSide_Interface1 );
        locations   faceNodes;

        readData  ( Displacement );
    }
    Interface3
    {
        mesh        Fluid-Faces2;
        patches     ( s_FluidSide_Interface2 );
        locations   faceCenters;

        writeData ( Stress );
    }
    Interface4
    {
        mesh        Fluid-Nodes2;
        patches     ( s_FluidSide_Interface2 );
        locations   faceNodes;

        readData  ( Displacement );
    }
    Interface5
    {
        mesh        Fluid-Faces3;
        patches     ( s_FluidSide_Interface3 );
        locations   faceCenters;

        writeData ( Stress );
    }
    Interface6
    {
        mesh        Fluid-Nodes3;
        patches     ( s_FluidSide_Interface3 );
        locations   faceNodes;

        readData  ( Displacement );
    }
}

FSI
{
    rho             rho [1 -3 0 0 0 0 0] 1;
}
